# Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 
a = int (input())
n1 = a % 10
n2 = a // 10 % 10
n3 = a // 100
print(n1+n2+n3)
